Config = {
    #-----------------------------------------------------------------#
    #   训练前一定要修改num_classes，不然会出现shape不匹配！
    #-----------------------------------------------------------------#
    'num_classes': 2,

    'min_dim': 300,
    'feature_maps': [19],  # 生成38*38，19*19，10*10，5*5，3*3，1*1的有效特征层

    'steps': [16],
    #----------------------------------------------------#

    'min_sizes': [60],
    'max_sizes': [111],
    
    'aspect_ratios': [[2]],
    'variance': [0.1, 0.2],
    'clip': True,
}

# --------------------------------------------------------------
# 先验框min_sizes大小的计算:
# 锚框在每个特征图上的缩放比例公式说明:Sk= Smin + (Smax-Smin)/(m-1) * (k-1),k∈[1,m],Smin=0.2,Smax=0.9
# 实际当中m=5并不是6，因为第一个特征层的Sk是单独设置为0.1
# 所以第一个先验框的尺寸为300*0.1=30。在实际计算中，因为要向下取整，所以要Sk= Smin*100 + 100*(Smax-Smin)/(m-1) * (k-1),k∈[1,m]
# 所以计算出Sk=20,37,54,71,88,再用这些数除以100后再乘图像大小，分别得到60，111，162，213，264  所以一共30, 60, 111, 162, 213, 264
# ---------------------------------------------------------------

# ---------------------------------------------------------------
# 'steps':参数的理解：计算先验框距离原图的步长，或者也可以理解为特征图映射到原图的倍数关系，比如conv4_3的大小为38*38，原图是300，则38*8≈300